{
  "title": "Charles Petzold's Blog",
  "date": "2025-05-26",
  "link": "https://www.charlespetzold.com/",
  "body": [
    "I've frequently enjoyed reading blogs from the early days of the internet. Admittedly, with a sort of voyeurism into the lives of the authors, who I have mainly found to be then middle-aged men with an interest in computers, and often other areas of academia¹. Maybe this sounds a little boring, and perhaps it is, but I can’t help but love the earnestness of it, and the rightful focus on covering subjects they are genuinely passionate about. One example is the blog of Charles Petzold, where over the course of a few days in 2020 during lockdown, I went down a rabbit hole consuming slightly too many of his posts. He appears to still be posting - I will disclaim here that I am not an active follower of the blog, but I would encourage you to check it out if, like me, you take something from other’s sharing something they are clearly passionate about. This is a small selection of posts I enjoyed:",
    "LINK|Garbage Cut, Garbage Pasted|https://www.charlespetzold.com/blog/2006/08/081106.html",
    "LINK|Three Favorite Compositions?|https://www.charlespetzold.com/blog/2007/12/Three-Favorite-Compositions.html",
    "LINK|Does the Moon Make Flower-Like Loops Around the Sun?|https://www.charlespetzold.com/blog/2025/02/Does-the-Moon-Make-Flower-Like-Loops-Around-the-Sun.html",
    "As I said, I am not an avid fan of this blog, so why start here? Subject matter aside, I like the simplicity and innocence these blogs exude. A quiet passion is often found at the heart of the content shared. Also critically, there doesn’t feel as if there’s an ulterior motive: no attempt to market a product; nor the “product of the individual” as much of social media does. Maybe that is the case for many other more modern blogs, but almost always I come away from them feeling something is missing in my life. They are often selling a lifestyle, be that a more sustainable life, more career driven, more nomadic, or anything else in between. Of course, they do this to build on something to set them aside from a sea of other online content. But what of the blogs that existed before the performative online culture we know today? The point was just to document some of their thoughts. Put them online, into the void, should anyone care to take a look.",
    "So that is why this is my first “thing” I would like to share, as it inspired me in part to create this blog. More than likely, the posts on here will just sit as a kind of repository for myself to look back on. However, it’s in the shape of the kind of online personal content I think the internet might just be better off filled by :)"
  ],
  "footnotes": [
    "¹ This may be a very biased viewpoint, from mainly discovering these kind of blogs while studying computer science at uni, but it also wouldn't surprise me if it is really the case..."
  ]
}
