{
  "title": "Bandstand in Southwark Park",
  "date": "2025-06-01",
  "image": "southwark-bandstand.jpg",
  "body": [
    "I came across this bandstand while in a particularly good mood, having spent the afternoon in Southwark park. A good book, plenty sun, a charming little rose garden and even an art gallery (where I spent the time trailing after a Northern lady loudly disparaging the contemporary artworks, a surprisingly welcome addition) are a recipe for a well spent Sunday in my view.",
    "Happily primed for reflection and waiting on a park bench for the next bus, I found myself musing why this bandstand was there, in a very general sense. It provides no real practical value. Even if used for live music back in the day, this itself could be viewed as frivolous - what’s a cynic’s purpose for building something, that I assume must have been quite expensive, to provide nothing more than public entertainment?¹ The same could be said for the construction and maintenance of the park too. Yet here I was, with a handful of others, gathered to relax and enjoy this space, where the bandstand was the focal point.",
    "It may seem trivial, but in this day and age when we seem to be constantly reminded of the destructive and consumption-oriented nature of people, it serves us well to also pay attention to counter-examples of this.² Examples of things which do not exclusively serve the individual. Things that bring us together, that speak to human nature, that show we all want to build a better world and that indeed people have the skills and passion to do so. Empathy, creativity, self-awareness, and an ability to appreciate beauty are vital, we should treat these traits with due reverence. Today, I am not sure how many of us would stop to appreciate this bandstand. I’m not sure I would, under other circumstances. But the worst thing we can do is discount it and the many other displays of human craftsmanship out there, to come to believe they’re not important, that they could more easily or cheaply be made at the expense of something much more vital.",
    "To close, while writing this I found that the bandstand was first designed and built for the 1862 International Exhibition in South Kensington, and later moved to Southwark Park in 1889 by the London City Council.³ Bandstands, in general, were mainly built in the Victorian era, in the belief that public walks and open spaces were good for physical health, and music for moral health.⁴ The version now is a reconstruction of the original, built in 1999 from the original drawings. Let us see how it stands the test of time."
  ],
  "footnotes": [
    "¹ The cynical answer that jumps to my mind here is pride: someone with influence’s pride in their area or city (going hand-in-hand with pride in themselves and their career, etc). But I don’t think that quite covers it. The bandstand was originally built more than 130 years ago, some kind of devotion has surely gone into it, to create a design of quality, preserve this, and later to reconstruct it.",
    "² I feel the need to clarify that I understand a bandstand is not necessarily the best example of anti-consumerism (...which is an odd sentence to write). It is certainly a frivolous use of resources, that could probably be used in a more constructive way. But to me it speaks of a joyous kind of frivolity, rather than the type of frivolity that makes me wonder what exactly society is coming to. Take that as you will.",
    "³ London Remembers, https://www.londonremembers.com/memorials/bandstand-southwark-park",
    "⁴ Google Arts & Culture, https://artsandculture.google.com/story/pAVh_mguwrE_Kg"
  ]
}
