{
  "title": "Kate Bush: Suspended in Gaffa",
  "date": "2025-06-09",
  "image": "suspended_in_gaffa2.jpg",
  "body": [
    "Kate Bush was a staple artist in my family growing up, so Suspended in Gaffa already has a strong sense of familiarity for me, but it wasn’t until I heard the song more recently that I really paid attention to it. It quickly turned into one of those magical times when listening, that the song becomes something that completely captures your attention, and you need to replay again & again to hear a specific part again -  a specific lyric, a specific hook.",
    "In signature style, it’s very theatrical, very poppy. The music reminds me of circus waltz, melodic and upbeat. However, in this case, it was the lyrics that caught me. Seeming to be both joyous and melancholic at the same time, they’re filled with biblical references, and a theme of wanting something you can’t have. Kate herself wrote about the song:",
    "QUOTE|“The idea … is that of being given a glimpse of “God”--something that we dearly want--but being told that unless we work for it, we will never see it again, and even then, we might not be worthy of it. Of course, everybody wants the reward without the toil, so people try to find a way out of the hard work, still hoping to claim the prize, but such is not the case. The choruses are meant to express the feeling of entering timelessness as you become ready for the experience, but only when you are ready”.¹",
    "This is close to, but not quite, the interpretation I had. My take was that the song was instead about the hollowness of wanting, especially something unachievable or idealised, which blindsides us to the things of value we already have and may be sacrificing to no good end. “Am I doing it? Can I have it all now?” has the echoes of a childlike statement, the intentionality behind what was being done in the first place is lost, and so the next resort is to seek external validation. And, of course, no-one can never “have it all”. Followed up later by the gently sung “I don’t know why I’m crying - am I suspended in gaffa?”, I took this as a call to action: don’t let these types of desires control your life, you are not actually powerless, and ultimately it is only you who can decide what is important to you."
  ],
  "footnotes": [
    "¹ Kate's Book Club Article Issue 12, http://gaffa.org/garden/kate14.html"
  ]
}
